/*==============================================================================*/
/*																				*/
/*	@file title	:	cSurfaceObject.cpp											*/
/*  @brief		:	サーフェイスオブジェクト									*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2020/03/03													*/
/*																				*/
/*==============================================================================*/

#include "cSurfaceObject.h"

//==========================================================================================
//  コンストラクタ
//==========================================================================================
cSurfaceObject::cSurfaceObject(IBaseObject * parent, const std::string & objectname, int width, int height, int beginPriority, int endPriority, int alpha) :
	IBaseObject(parent, objectname),
	cSurface(width,height,beginPriority,endPriority,alpha)
{
}

//==========================================================================================
//  デストラクタ
//==========================================================================================
cSurfaceObject::~cSurfaceObject(void)
{
}

//==========================================================================================
//  初期化
//==========================================================================================
void
cSurfaceObject::
Initialize(void)
{
	IBaseObject::Initialize();
	cSurface::Initialize();
}

//==========================================================================================
//  初期化
//==========================================================================================
void cSurfaceObject::Initialize( const cVector2& pos )
{
	m_vPos = pos;
	Initialize();
}

//==========================================================================================
//  更新
//==========================================================================================
void cSurfaceObject::Update(void)
{
	IBaseObject::Update();
	cSurface::Update();

}

//==========================================================================================
//  解放
//==========================================================================================
IBaseObject* cSurfaceObject::Finalize(void)
{
	IBaseObject::Finalize();
	cSurface::Finalize();
	return this;
}