/*==============================================================================*/
/*																				*/
/*	@file title	:	cFlameHitEffect.cpp											*/
/*  @brief		:	炎攻撃ヒットエフェクトクラス								*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2020/04/10													*/
/*																				*/
/*==============================================================================*/

#include "cFlameHitEffect.h"
#include "..\cEffectManager.h"

//==========================================================================================
// 定数
//==========================================================================================
const int cFlameHitEffect::PRIORITY = 300;
const float cFlameHitEffect::SCALE = 25.0f;

//==========================================================================================
// コンストラクタ
//==========================================================================================
cFlameHitEffect::cFlameHitEffect(IBaseObject* parent)
	: cEffectObject(parent, "FlameHit", cEffectManager::GetInstance().GetEffectFilename(EFFECT_ID::FLAME_HIT))
{
}

//==========================================================================================
// デストラクタ
//==========================================================================================
cFlameHitEffect::~cFlameHitEffect(void)
{
}

//==========================================================================================
// 初期化
//==========================================================================================
void cFlameHitEffect::Initialize(void)
{

	SetPriority(PRIORITY);
	SetScale(SCALE);

	cEffectObject::Initialize();
}