#pragma once
/*==============================================================================*/
/*																				*/
/*	@file title	:	SpEffectIDh													*/
/*  @brief		:	スプライトエフェクトリスト									*/
/*	@written	:	s.kosugi													*/
/*	@create		:	2020/04/05													*/
/*																				*/
/*==============================================================================*/

enum class SpEffectID{
	REDFAIRY_DEAD = 0,			// 赤妖精死亡エフェクト
	BLUEFAIRY_DEAD,				// 青妖精死亡エフェクト

	MAX
};