/*==============================================================================*/
/*																				*/
/*	@file title	:	cEffectObject.cpp											*/
/*  @brief		:	エフェクトオブジェクト										*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2018/12/16													*/
/*																				*/
/*==============================================================================*/

#include "cEffectObject.h"
#include "..\..\..\DrawCtrl\cDrawCtrl.h"
#include "..\..\..\cGame.h"

//==========================================================================================
//  コンストラクタ
//==========================================================================================
cEffectObject::cEffectObject(IBaseObject* parent, const std::string& objectname, const std::string& filename) :
	IBaseObject(parent, objectname),
	cEffect(filename)
{

}

//==========================================================================================
//  デストラクタ
//==========================================================================================
cEffectObject::~cEffectObject(void)
{
}

//==========================================================================================
//  初期化
//==========================================================================================
void
cEffectObject::
Initialize(void)
{
	IBaseObject::Initialize();
	cEffect::Initialize();
}

//==========================================================================================
//  初期化
//==========================================================================================
void cEffectObject::Initialize( const cVector2& pos )
{
	m_vPos = pos;
	Initialize();
}

//==========================================================================================
//  更新
//==========================================================================================
void cEffectObject::Update(void)
{
	// エフェクトの再生が終了したら破棄する
	if(IsEffectEnd())
		m_eObjectState = OBJECT_STATE::DEAD;

	IBaseObject::Update();
	cEffect::Update();
}

//==========================================================================================
//  解放
//==========================================================================================
IBaseObject* cEffectObject::Finalize(void)
{
	IBaseObject::Finalize();
	cEffect::Finalize();
	return this;
}