/*==============================================================================*/
/*																				*/
/*	@file title	:	cIceAttackEffect.cpp										*/
/*  @brief		:	氷攻撃エフェクトクラス										*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2020/04/10													*/
/*																				*/
/*==============================================================================*/

#include "cIceAttackEffect.h"
#include "..\cEffectManager.h"

//==========================================================================================
// 定数
//==========================================================================================
const int cIceAttackEffect::PRIORITY = 300;
const float cIceAttackEffect::SCALE = 25.0f;

//==========================================================================================
// コンストラクタ
//==========================================================================================
cIceAttackEffect::cIceAttackEffect(IBaseObject* parent)
	: cEffectObject(parent, "IceAttack", cEffectManager::GetInstance().GetEffectFilename(EFFECT_ID::ICEATTACK))
{
}

//==========================================================================================
// デストラクタ
//==========================================================================================
cIceAttackEffect::~cIceAttackEffect(void)
{
}

//==========================================================================================
// 初期化
//==========================================================================================
void cIceAttackEffect::Initialize(void)
{

	SetPriority(PRIORITY);
	SetScale(SCALE);

	cEffectObject::Initialize();
}