/*==============================================================================*/
/*																				*/
/*	@file title	:	cTextObject.cpp												*/
/*  @brief		:	テキストオブジェクト										*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2018/12/02													*/
/*																				*/
/*==============================================================================*/

#include "cTextObject.h"

//==========================================================================================
//  コンストラクタ
//==========================================================================================
cTextObject::cTextObject(IBaseObject* parent, const std::string& objectname, const std::string& text) :
	IBaseObject(parent, objectname),
	cText(text)
{
}
//==========================================================================================
//  コンストラクタ
//==========================================================================================
cTextObject::cTextObject(IBaseObject * parent, const std::string & objectname, const std::string & text, const std::string& fontname, int fontsize, int Thick, int FontType, int EdgeSize, int Italic) :
	IBaseObject(parent, objectname),
	cText(text, fontname, fontsize, Thick, FontType, EdgeSize, Italic)
{
}
//==========================================================================================
//  デストラクタ
//==========================================================================================
cTextObject::~cTextObject(void)
{
}

//==========================================================================================
//  初期化
//==========================================================================================
void
cTextObject::
Initialize(void)
{
	IBaseObject::Initialize();
	cText::Initialize();
}

//==========================================================================================
//  初期化
//==========================================================================================
void cTextObject::Initialize( const cVector2& pos )
{
	m_vPos = pos;
	Initialize();
}

//==========================================================================================
//  更新
//==========================================================================================
void cTextObject::Update(void)
{
	IBaseObject::Update();
	cText::Update();
}

//==========================================================================================
//  解放
//==========================================================================================
IBaseObject* cTextObject::Finalize(void)
{
	IBaseObject::Finalize();
	cText::Finalize();
	return this;
}