/*==============================================================================*/
/*																				*/
/*	@file title	:	cBackGround.cpp												*/
/*  @brief		:	背景クラス													*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2019/04/23													*/
/*																				*/
/*==============================================================================*/

#include "cBackGround.h"
#include "SceneManager/Scene/GameMain/cGameMain.h"


//==========================================================================================
// 定数
//==========================================================================================
const int   cBackGround::PRIORITY = -100;
const float cBackGround::SCROLL_SPEED = 5.0f;

//==========================================================================================
// コンストラクタ
//==========================================================================================
cBackGround::cBackGround( IBaseObject* parent )
	: cSpriteObject( parent, "BackGround", "data\\graphic\\bg_01.png" )
{
}

//==========================================================================================
// デストラクタ
//==========================================================================================
cBackGround::~cBackGround( void )
{
}

//==========================================================================================
// 初期化
//==========================================================================================
void cBackGround::Initialize( void )
{
	SetPriority( PRIORITY );
	cSpriteObject::Initialize();
}

//==========================================================================================
// 更新
//==========================================================================================
void cBackGround::Update( void )
{
	cGameMain* gm = (cGameMain*)GetParent();

	// ゲームプレイ中のみ背景を動かす
	if(gm->GetGameState() == cGameMain::GAME_STATE::PLAY )m_vPos.x -= SCROLL_SPEED;

	// 完全に画面範囲外に出たらスクロールを切り替える
	if( m_vPos.x + GetGraphichSize().x / 2.0f < 0.0f )
	{
		m_vPos.x += GetGraphichSize().x * 2.0f;
	}
	cSpriteObject::Update();
}