#pragma once
/*==============================================================================*/
/*																				*/
/*	@file title	:	cBackGround.h												*/
/*  @brief		:	îwåiÉNÉâÉX													*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2019/04/23													*/
/*																				*/
/*==============================================================================*/

#include "..\..\cSpriteObject.h"

//================================================================================================
// îwåiÉNÉâÉX
class cBackGround : public cSpriteObject
{
public:
	cBackGround( IBaseObject* parent );
	~cBackGround( void );

	void Initialize( void );
	void Update( void );

private:

	//--------------------------------------------------------------------------------------------
	// íËêî

	// ï\é¶óDêÊìx
	static const int	PRIORITY;

	// îwåiÉXÉNÉçÅ[Éãë¨ìx
	static const float	SCROLL_SPEED;
	//--------------------------------------------------------------------------------------------

};
//================================================================================================